#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

#### Preview environment 🔗
["https://terraform-managed-arrangement-svc-preview-api.bekk.dev/arrangement-svc*"
]("https://terraform-managed-arrangement-svc-preview-api.bekk.dev/arrangement-svc*"
)

<details><summary>Show plan for apply after merge to master</summary>

```hcl

terraform
Acquiring state lock. This may take a few moments...
module.aws-deploy.random_string.suffix: Refreshing state... [id=qEfYxm4Yp5ww8yLZNIUznb3WEcouCvaY]
module.aws-deploy.aws_ecs_task_definition.main: Refreshing state... [id=bekk-arrangement-svc-dev]
module.aws-deploy.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/dev-qEfYxm4Yp5ww8yLZNIUznb3WEco/05fced12fd9f0a78]
module.aws-deploy.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev]
module.aws-deploy.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/bc07e8037c928025]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-deploy.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev"
        name                               = "bekk-arrangement-svc-dev"
        tags                               = {
            "Terraform" = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:20" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.aws-deploy.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:20" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "882089634282.dkr.ecr.eu-central-1.amazonaws.com/bekk-arrangement-svc:3949def08bc895a91b2e5bf24b82a59952b8830d" -> "882089634282.dkr.ecr.eu-central-1.amazonaws.com/bekk-arrangement-svc:latest"
                  ~ logConfiguration = {
                      ~ logDriver = "awslogs" -> "awsfirelens"
                      ~ options   = {
                          + Name                  = "firehose"
                          - awslogs-group         = "bekk-ecs-dev" -> null
                          - awslogs-region        = "eu-central-1" -> null
                          - awslogs-stream-prefix = "fargate" -> null
                          + delivery_stream       = "bekk-firehose-logs"
                          + region                = "eu-central-1"
                          + retry_limit           = "2"
                        }
                    }
                    name             = "bekk-arrangement-svc-dev"
                    # (7 unchanged elements hidden)
                } # forces replacement,
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit"
                  + logConfiguration      = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "firelens-container"
                          + awslogs-region        = "eu-central-1"
                          + awslogs-stream-prefix = "firelens"
                        }
                    }
                  + name                  = "log_router"
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::882089634282:role/bekk-ecsTaskExecutionRole" -> "arn:aws:iam::882089634282:role/bekk-ecsTaskExecutionRole-dev" # forces replacement
      ~ id                       = "bekk-arrangement-svc-dev" -> (known after apply)
      ~ revision                 = 20 -> (known after apply)
        tags                     = {
            "Name"      = "bekk-arrangement-svc-dev"
            "Terraform" = "true"
        }
      ~ task_role_arn            = "arn:aws:iam::882089634282:role/bekk-ecsTaskRole" -> "arn:aws:iam::882089634282:role/bekk-ecsTaskRole-dev" # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @omaen, Action: `pull_request`*